doc/2024_10_10-random-intercept/post-random-intercept.org
#+TITLE: Random intercept model in a balanced design
#+Author: Brice Ozenne


* Notations

Consider an outcome variable \(Y\) measured in \(n\) subjects at \(p\)
occasions. We will index the subjects by \(i \in \{1,\ldots,n\}\) and
the occasions by \(j \in \{1,\ldots,p\}\). During their follow-up each
subject is subject to an active (\(T=1\)) and a control treatment
(\(T=0\)) respectively \(p_1\) and \(p_0\) times. We will use the bold
notation to denote vector of random variables, e.g.
\(\VT_i=\{T_{i,1},\ldots,T_{i,p}\}\).

\bigskip

\noindent As a working model we will consider the following random intercept
model:
#+BEGIN_EXPORT latex
\begin{align*}
Y_{i,j} = \alpha + \beta T_{i,j} + u_i + \Vvarepsilon_{i,j}
\end{align*}
#+END_EXPORT
where \(u_i \sim \Gaus[0,\tau]\) and \(\varepsilon_{i,j} \sim
\Gaus[0,\delta]\). Introducing \(\rho = \frac{\tau}{\tau+\delta}\) and
\(\sigma^2=\tau+\delta\), we can then express the residual
variance-covariance matrix as:
#+BEGIN_EXPORT latex
\begin{align*}
\Var[\VY_{i}|\VT_i] = \Var[u_{i} + \Vvarepsilon_{i}|T_i] = \Omega = \sigma^2 R = \sigma^2 ((1-\rho) I + \rho \Ve\trans{\Ve})
\end{align*}
#+END_EXPORT
where \(I\) denotes the \(p \times p\) identity matrix and \(\Ve\) a
corresponding of size \(p\) containing only 1. \(\Theta =
(\alpha,\beta,\delta,\tau)\) or equivalently
\((\alpha,\beta,\rho,\sigma)\) will denote the vector of model
parameters and \(\Vmu_{i}=\left(\alpha+\beta
T_{i1},\ldots,\alpha+\beta T_{ip}\right)\) the vector of fitted
values. Note that since we assume a balanced design and since
\(\Omega\) is unchanged by re-ordering, we can re-order the data such
that \(\VT_i=\VT_{i^{\prime}}=\VT\) for all \((i,i^{\prime})\in\{1,\ldots,n\}^2\).

\clearpage

* Estimates in a random intercept model

** Theory

Appendix [[#sm:rhoML]] shows that the Maximum Likelihood estimate of \(\Theta\) are:
- *mean parameters*: \(\widehat{\alpha}= \frac{1}{np} \sum_{i=1}^n
  \sum_{j=1}^p (1-T_{i,j}) Y_{i,j}\) \newline
  @@latex:\hphantom{\textbf{mean parameters:} }@@ \(\widehat{\beta}=
  \frac{1}{np} \sum_{i=1}^n \sum_{t=1}^p (2 T_{i,j}-1) Y_{i,j} \) \newline
  @@latex:\hphantom{\textbf{mean parameters:} }@@ \(\widehat{\mu}_{i,j} = \widehat{\alpha} + T_{i,j}\widehat{\beta}\)
- *variance parameter*: \(\widehat{\sigma}^2 =
  \frac{1}{np}\sum_{i=1}^n\sum_{j=1}^p (Y_{i,j}-\widehat{\mu}_{i,j})^2\)
- *correlation parameter*: \(\widehat{\rho} =
  \frac{1}{p(p-1)/2}\sum_{j=1}^p \sum_{j^{\prime} \in
  \{1,\ldots,j-1\}}\widehat{\rho}_{j,j^{\prime}}\) \newline where for
  \(j \in \{1,\ldots,p\}\), \(j^{\prime} \in \{1,\ldots,j-1\}\),
  \(\widehat{\rho}_{j,j^{\prime}} = \frac{1}{n}\sum_{i=1}^n
  \frac{(Y_{i,j}-\widehat{\mu}_{i,j})}{\widehat{\sigma}}\frac{(Y_{i,j^{\prime}}-\widehat{\mu}_{i,j^{\prime}})}{\widehat{\sigma}}\)
i.e. the empirical mean of the outcome, the empirical residual
variance, and the average empirical residual correlation.

