doc/2024_10_10-random-intercept/post-random-intercept.tex

\subsection{Numerical example}
\label{sec:orgc186772}

We will illustrate the previous result on an example. First we
simulate some data in the long format:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(LMMstar)
library(lava)
library(Matrix)

set.seed(1)
n.obs <- 1e3
n.times <- 4
dfL <- sampleRem(n.obs, n.times = n.times, format = "long",
                 mu = c(1,0,0,0), sigma = 1:4, lambda = c(0.5,0.25,2,1))
dfL <- dfL[order(dfL$id),c("id","visit","Y")]
dfL$treatment <- as.numeric(dfL$visit) %% 2
head(dfL)
\end{lstlisting}

\begin{verbatim}
  id visit          Y treatment
1  1     1  0.2551614         1
2  1     2  0.7913185         0
3  1     3 -2.1031314         1
4  1     4 -0.4489691         0
5  2     1  1.5637433         1
6  2     2 -0.1637081         0
\end{verbatim}



\clearpage

Converting to the wide format facilitate the calculation of the time
specific mean, variance, and correlation:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dfW <- reshape(dfL[,c("id","visit","Y")],
               direction = "wide", idvar = "id", timevar = "visit")
rbind(mean = colMeans(dfW[,-1]),
      var = apply(dfW[,-1],2,var))
cor(dfW[,-1])
\end{lstlisting}

\begin{verbatim}
          Y.1       Y.2       Y.3       Y.4
mean 1.534321 0.2534847  2.101116  1.040294
var  3.770008 1.6149499 47.740082 12.611689
          Y.1       Y.2       Y.3       Y.4
Y.1 1.0000000 0.5515201 0.8579057 0.8330143
Y.2 0.5515201 1.0000000 0.6468049 0.6131780
Y.3 0.8579057 0.6468049 1.0000000 0.9503735
Y.4 0.8330143 0.6131780 0.9503735 1.0000000
\end{verbatim}

\subsubsection{Maximum likelihood}
\label{sec:org8cf057d}

A random intercept model estimated by Maximum Likelihood (ML) leads to
the following results:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eML.RI <- lmm(Y~treatment+(1|id), data = dfL, method.fit = "ML")
coef(eML.RI, effects = "all")
\end{lstlisting}

\begin{verbatim}
(Intercept)   treatment       sigma     rho(id) 
  0.6468893   1.1708292   4.0663607   0.5049300
\end{verbatim}


We retrive the empirical means for the intercept and treatment effects:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
alphaHat <- mean(dfL$Y[dfL$treatment == 0])
betaHat <- mean(dfL$Y[dfL$treatment == 1]) - alphaHat
c(alphaHat, betaHat)
\end{lstlisting}

\begin{verbatim}
[1] 0.6468893 1.1708292
\end{verbatim}


the empirical squared residuals for the variance:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dfL$res <- dfL$Y - alphaHat - dfL$treatment*+betaHat
sqrt(mean(dfL$res^2))
\end{lstlisting}

\begin{verbatim}
[1] 4.066361
\end{verbatim}


\clearpage

and the empirical residual correlation:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dfL$res.normML <- dfL$res/sqrt(mean(dfL$res^2))
dfWres.normML <- reshape(dfL[,c("id","visit","res.normML")],
                         direction = "wide", idvar = "id", timevar = "visit")
M.MLcor <- crossprod(as.matrix(dfWres.normML[,-1]))/n.obs
mean(M.MLcor[lower.tri(M.MLcor)])
\end{lstlisting}

\begin{verbatim}
[1] 0.50493
\end{verbatim}

\subsubsection{Restricted maximum likelihood}
\label{sec:org81fa793}

When fitting a random intercept model estimated by Maximum Likelihood
(REML):
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eREML.RI <- lmm(Y~treatment+(1|id), data = dfL, method.fit = "REML")
coef(eREML.RI, effects = "all")
\end{lstlisting}

\begin{verbatim}
(Intercept)   treatment       sigma     rho(id) 
  0.6468893   1.1708292   4.0678916   0.5051376
\end{verbatim}


We retrive the empirical means for the intercept and treatment
effects.  However we do not 'exactly' retrieve the REML estimate of the residual
standard deviation using:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
sd(dfL$res)
\end{lstlisting}

\begin{verbatim}
[1] 4.066869
\end{verbatim}


To closer we can get would be using 3 degrees of freedom:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
NROW(dfL)-sum(tapply(dfL$res^2, dfL$visit, sum))/(coef(eREML.RI, effects = "variance"))^2
\end{lstlisting}

\begin{verbatim}
   sigma 
3.010256
\end{verbatim}



We do not 'exactly' retrieve the REML estimate of the residual
correlation using the Pearson correlation:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dfL$res.normREML <- dfL$res/coef(eREML.RI, effects = "variance")
dfWres.normREML <- reshape(dfL[,c("id","visit","res.normREML")],
                           direction = "wide", idvar = "id", timevar = "visit")
M.REMLcor <- crossprod(as.matrix(dfWres.normREML[,-1]))/(NROW(dfWres.normREML)-1)
mean(M.REMLcor[lower.tri(M.REMLcor)])
\end{lstlisting}

\begin{verbatim}
[1] 0.505055
\end{verbatim}


\clearpage

\section{Standard error in a random intercept model}
\label{sec:orgab137fa}

\subsection{Theory}
\label{sec:org36aa148}

Appendix \ref{sm:seRI} shows that the standard error of the treatment
effect estimator can be expressed as:
\begin{align*}
\sigma_{\widehat{\beta}} =\sqrt{\frac{\delta}{n} \frac{p}{p_1(p-p_1)}}
\end{align*}

It also shows that in the special case of Maximum Likelihood
estimation with as many observations under treatment as under control
(\(p_1=p/2\)) it simplifies to:
\begin{align}
\sigma_{\widehat{\beta}} = \sqrt{\frac{2\left(1-\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}} \rho_{j,j^{\prime}}\right) \sigma^2}{n p_1}} \label{eq:seML}
\end{align}
where for \(j \in \{1,\ldots,p\}\), \(j^{\prime} \in
  \{1,\ldots,j-1\}\):
\begin{align*}
\rho_{j,j^{\prime}} &= \Esp\left[\frac{(Y_{.,j}-\mu_{.,j})}{\sigma}\frac{(Y_{.,j^{\prime}}-\mu_{.,j^{\prime}})}{\sigma}\right] \\
                  &\approx \frac{1}{n}\sum_{i=1}^n \frac{(Y_{i,j}-\mu_{i,j})}{\sigma}\frac{(Y_{i,j^{\prime}}-\mu_{i,j^{\prime}})}{\sigma}
\end{align*}
which can be understood as the data generating within-subject
correlation between observation \(j\) and \(j^{\prime}\), provided
that the mean and variance structure of the model are correctly specified. 

\subsection{Comparison to a t-test on the first change}
\label{sec:org7ecd184}

When using a t-test on the change based \textbf{only on the first observation
under each treatment}, the standard error is:
\begin{align*}
\sigma_{\widehat{\Delta}(1)} = \sqrt{\frac{2(1-\rho_{1,p_1+1}) \sigma^2}{n}}
\end{align*}

where for convenience the first \(p_1\) observations are under one
treatment condition and the last \(p_1\) observations under the other
treatment condition. This strategy controls the type 1 error and is
optimal if observations from the same treatment are (nearly) perfectly
correlated i.e. \(\rho_{j,j^{\prime}} \approx 1\) if
\((j,j^{\prime})\in \{1,\ldots,p_1\}^2\) or if \((j,j^{\prime})\in
\{p_1+1,\ldots,p_1^2\}\). In such a case the cross-correlation must be
(nearly) constant for the correlation matrix to be positive
definite. We thus have:
\begin{align*}
\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}} \rho_{j,j^{\prime}} &= \frac{2(p/2)(p/2-1)/2 \rho_{1,1} +(p/2)^2 \rho_{1,p_1+1}}{p(p-1)/2} \\
&= \frac{(p/2-1)\rho_{1,1}+p/2 \rho_{1,p_1+1}}{p-1} = \frac{p\frac{\rho_{1,p_1+1}+\rho_{1,1}}{2} - \rho_{1,1}}{p-1} \\
&= \rho_{1,1} - \frac{p}{2(p-1)}(\rho_{1,1}-\rho_{1,p_1+1}) \approx 1 - \frac{p}{2(p-1)}(1-\rho_{1,p_1+1})
\end{align*}


\noindent The random intercept model will not control the type 1 error
whenever \(\sigma_{\widehat{\Delta}(1)}>\sigma_{\widehat{\beta}}\):
\begin{align*}
1-\rho_{1,p_1+1} &> \frac{1-\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}} \rho_{j,j^{\prime}}}{p_1} = \frac{1}{p-1}(1-\rho_{1,p_1+1})
\end{align*}
which is always true unless \(p=1\) (no repetition) or \(\rho_{1,p_1+1}\approx 1\) (compound symmetry structure).
