doc/2024_10_10-random-intercept/post-random-intercept.tex

\subsection{Comparison to a t-test on changes in a paired design}
\label{sec:orgfe9b217}

Consider now computing \(p_1\) changes per patient, e.g. \(p_1+1\)
vs. \(1\), \(p_1+2\) vs. \(2\), \ldots, using only distinct
observations (no observation is used twice when computing changes),
and stacking all changes into a t-test. This strategy will generally
not control the type 1 error (as it disregard within-individual
correlation). The standard error of the corresponding estimator can be
expressed as:
\begin{align*}
\sigma_{\widehat{\Delta}(p_1)} = \sqrt{\frac{2(1-\rho_{1,p_1+1}) \sigma^2}{np_1}}
\end{align*}

Assuming constant within (no necessarily close to one) and constant
cross-correlation we can compare this variance with the mixed model
variance:
\begin{align*}
\sigma_{\widehat{\beta}} - \sigma_{\widehat{\Delta}(p)} = \sqrt{\frac{4\left(1-\rho_{1,1} + \frac{p}{2(p-1)}(\rho_{1,1}-\rho_{1,p_1+1})\right) \sigma^2}{n p}} -  \sqrt{\frac{4(1-\rho_{1,p_1+1}) \sigma^2}{np}}
\end{align*}
which has the same sign as:
\begin{align*}
\left(1-\rho_{1,1} + \frac{p}{2(p-1)}(\rho_{1,1}-\rho_{1,p_1+1})\right) - (1-\rho_{1,p_1+1})
& = (\rho_{1,1}-\rho_{1,p_1+1}) \left(\frac{p}{2(p-1)} - 1 \right) \\
& = (\rho_{1,1}-\rho_{1,p_1+1}) \frac{2-p}{2(p-1)} 
\end{align*}

Because \(\frac{2-p}{2(p-1)}<0\) the mixed model will be more liberal
(i.e. provide a worse type 1 error control) if
\(\rho_{1,1}>\rho_{1,p_1+1}\) otherwise it will be less liberal.

\subsection{Numerical example}
\label{sec:orgb701c29}

We can retrieve the standard error estimated by the linear mixed model:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
model.tables(eML.RI)["treatment",]
\end{lstlisting}

\begin{verbatim}
          estimate         se       df     lower    upper p.value
treatment 1.170829 0.09047721 2999.845 0.9934256 1.348233       0
\end{verbatim}


pluging in formula \autoref{eq:seML} the variance and correlation
estimates based on the residuals:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
sqrt(2*(1-mean(M.MLcor[lower.tri(M.MLcor)]))*mean(dfL$res^2)/(n.obs*n.times/2))
\end{lstlisting}

\begin{verbatim}
[1] 0.09047721
\end{verbatim}




\clearpage

\appendix

\section{Inverse of a compound symmetry matrix}
\label{sm:invCS}
Consider the compound symmetry matrix:
\begin{align*}
R= (1-\rho) I + \rho \Ve\trans{\Ve}= \rho\left(\frac{1-\rho}{\rho} I + \Ve\trans{\Ve}\right) 
\end{align*}
The Sherman-Morrison formula indicates that:
\begin{align*}
R^{-1} &= \rho^{-1} \left(\frac{\rho}{1-\rho} I - \frac{\rho^2}{(1-\rho)^2}\frac{\Ve\trans{\Ve}}{1+\frac{\rho}{1-\rho}\trans{\Ve}\Ve}\right) = \frac{1}{1-\rho} I - \frac{\rho}{(1-\rho)^2}\frac{\Ve\trans{\Ve}}{1+\frac{\rho}{1-\rho}p} \\
&=  \frac{1}{1-\rho} I - \frac{\rho \Ve\trans{\Ve}}{(1-\rho)^2+\rho(1-\rho)p} =  \frac{1}{1-\rho} \left(I - \frac{\rho \Ve\trans{\Ve}}{1+\rho(p-1)}\right)
\end{align*}

\section{Estimates in a random intercept model}
\label{sm:rhoML}
The log-likelihood of a random intercept model can be written:
\begin{align*}
\Likelihood(\Theta|\VY,\VT) =& \sum_{i=1}^{n} \left(-\frac{m}{2} \log(2\pi) - \frac{1}{2} \log\left|\Omega\right| - \frac{1}{2} \trans{(\VY_i-\Vmu_i)} \Omega^{-1} (\VY_i-\Vmu_i) \right)
\end{align*}
and the corresponding restricted likelihood:
\begin{align*}
\Likelihood^R(\Theta|\VY,\VT) = \Likelihood(\Theta|\VY,\VT) + \frac{p}{2} \log(2\pi)-\frac{1}{2} \log\left(\left|\sum_{i=1}^n \trans{\VZ}_i \Omega^{-1} \VZ_i \right|\right)
\end{align*}
where \(\VZ_i = (1,\VT_i)\) is the design matrix w.r.t. subject \(i\).


\subsection{Mean parameters}
\label{sec:orgdd32b14}

The score equation w.r.t. the mean parameters is identical when
considering the log-likelihood or the restricted log-likelihood. Using
the expression of \(R^{-1}\) found in appendix \ref{sm:rhoML} we get:
\begin{align*}
\begin{bmatrix}
0 \\ 0
\end{bmatrix}
=
\begin{bmatrix}
\sum_{i=1}^n \trans{e}\Omega^{-1} (\VY_i-\Vmu_i)) \\
\sum_{i=1}^n \trans{\VT}\Omega^{-1} (\VY_i-\Vmu_i)
\end{bmatrix}
=
\begin{bmatrix}
\frac{1}{\sigma^2(1-\rho)}\sum_{i=1}^n \trans{e}\left(I- \frac{\rho \Ve \trans{\Ve}}{1+\rho(p-1)}\right) (\VY_i-\Vmu_i) \\
\frac{1}{\sigma^2(1-\rho)}\sum_{i=1}^n \trans{\VT}\left(I- \frac{\rho \Ve \trans{\Ve}}{1+\rho(p-1)}\right) (\VY_i-\Vmu_i)
\end{bmatrix}
\end{align*}

which is equivalent to:
\begin{align*}
\begin{bmatrix}
0 \\ 0
\end{bmatrix}
&=
\begin{bmatrix}
\sum_{i=1}^n \left(\trans{e}(\VY_i-\Vmu_i)- \frac{\rho p \trans{\Ve}(\VY_i-\Vmu_i)}{1+\rho(p-1)}\right) \\
\sum_{i=1}^n \left(\trans{\VT}(\VY_i-\Vmu_i)- \frac{\rho p_1 \trans{\Ve}(\VY_i-\Vmu_i)}{1+\rho(p-1)}\right) 
\end{bmatrix} \\ 
& =
\begin{bmatrix}
\left(1 - \frac{\rho p}{1+\rho(p-1)}\right) \sum_{i=1}^n \trans{e}(\VY_i-\Vmu_i) \\
\sum_{i=1}^n \trans{\VT}(\VY_i-\Vmu_i)- \frac{\rho p_1}{1+\rho(p-1)} \sum_{i=1}^n \trans{\Ve}(\VY_i-\Vmu_i)
\end{bmatrix}
\end{align*}
Using that \(1 - \frac{\rho p}{1+\rho(p-1)} = 1 + \rho(p-1) - \rho p =
1 - \rho > 0\) and substracting \(p_1/p\) times equation 1 from equation 2 we get:
\begin{align*}
\begin{bmatrix}
0 \\ 0
\end{bmatrix}
& =
\begin{bmatrix}
\sum_{i=1}^n \trans{e}(\VY_i-\Vmu_i) \\
\sum_{i=1}^n \trans{\VT}(\VY_i-\Vmu_i) - \frac{p_1}{p}\sum_{i=1}^n \trans{\Ve}(\VY_i-\Vmu_i)
\end{bmatrix}
\end{align*}
Denoting the by \(\widehat{\alpha}= \frac{1}{np} \sum_{i=1}^n
\sum_{t=1}^p (1-T_{it}) Y_{it}\) and \(\widehat{\beta}= \frac{1}{np}
\sum_{i=1}^n \sum_{t=1}^p T_{it} Y_{it} - \widehat{\alpha}\) the
empirical mean over timepoints and patients under control and under
treatment. The former equations are equivalent to:
\begin{align*}
\begin{bmatrix}
0 \\ 0
\end{bmatrix}
& =
\begin{bmatrix}
\widehat{\alpha} - \alpha + p_1 (\widehat{\beta} - \beta) \\
p_1 (\widehat{\alpha} + \widehat{\beta} - \alpha - \beta) - \frac{p_1}{p} (\widehat{\alpha} - \alpha + p_1 (\widehat{\beta} - \beta))
\end{bmatrix} \\
\begin{bmatrix}
0 \\ 0
\end{bmatrix} 
& =
\begin{bmatrix}
\widehat{\alpha} - \alpha + (\widehat{\beta} - \beta) \\
(\widehat{\alpha} - \alpha + \widehat{\beta} - \beta ) - \frac{1}{p} (\widehat{\alpha} - \alpha + p_1 (\widehat{\beta} - \beta))
\end{bmatrix} 
\end{align*}
So \(\widehat{\beta} - \beta = -\frac{1}{p_1}(\widehat{\alpha} - \alpha)\) and:
\begin{align*}
0 = (\widehat{\alpha} - \alpha)\left(1-\frac{1}{p_1}-\frac{1}{p}+1) \right)
\end{align*}
Since design \(p_0 \geq 1\) and \(p \geq 2\) so \(2-\frac{1}{p_1}-\frac{1}{p} \geq 0.5\). It
follows that \(\alpha = \widehat{\alpha}\) and therefore
\(\beta=\widehat{\beta}\): the maximum likelihood (ML) and restricted
maximum likelihood (REML) estimates of the mean parameters are the
empirical means in the appropriate sub-groups.
