doc/2024_10_10-random-intercept/post-random-intercept.tex

\subsection{Correlation parameter (ML)}
\label{sec:org6358f21}

The ML score equation w.r.t the correlation parameter is:
\begin{align*}
0 =& -\frac{n}{2} tr\left(\Omega^{-1} \frac{\partial \Omega}{\partial\rho}\right) + \frac{1}{2} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} \Omega^{-1} \frac{\partial \Omega}{\partial \rho} \Omega^{-1} (\VY_i-\widehat{\Vmu}_i) \\
  =& -\frac{n}{2} tr\left(R^{-1} \frac{\partial R}{\partial\rho}\right) + \frac{1}{2\sigma^2} tr\left(R^{-1} \frac{\partial R}{\partial \rho} R^{-1} \sum_{i=1}^n (\VY_i-\widehat{\Vmu}_i)\trans{(\VY_i-\widehat{\Vmu}_i)}\right) 
\end{align*}

We first explicit the first term:
\begin{align*}
R^{-1} \frac{\partial R}{\partial\rho} &= \frac{1}{1-\rho} \left(I - \frac{\rho \Ve\trans{\Ve}}{1+\rho(p-1)}\right)\left(-I + \Ve\trans{\Ve}\right) \\
&= \frac{1}{1-\rho} \left(-I + \Ve\trans{\Ve} + \frac{\rho \Ve\trans{\Ve}}{1+\rho(p-1)} - \frac{\rho p \Ve\trans{\Ve}}{1+\rho(p-1)}\right)\\
&= \frac{1}{1-\rho} \left(-I + \Ve\trans{\Ve} \frac{1+\rho(p-1)+\rho-\rho p}{1+\rho(p-1)}\right)\\
&= \frac{1}{1-\rho} \left(-I +  \frac{\Ve\trans{\Ve}}{1+\rho(p-1)}\right)
\end{align*}

Thus:
\begin{align*}
tr \left( R^{-1} \frac{\partial R}{\partial\rho} \right) &= \frac{p}{1-\rho}\left(-1+\frac{1}{1+\rho(p-1)}\right) = -\frac{p\rho(p-1)}{(1-\rho)(1+\rho(p-1))}
\end{align*}

We now consider:
\begin{align*}
R^{-1} \frac{\partial R}{\partial\rho} R^{-1} &= \frac{1}{(1-\rho)^2} \left(-I +  \frac{\Ve\trans{\Ve}}{1+\rho(p-1)}\right)\left(I - \frac{\rho \Ve\trans{\Ve}}{1+\rho(p-1)}\right) \\
&= \frac{1}{(1-\rho)^2} \left(-I + \frac{\rho \Ve\trans{\Ve}}{1+\rho(p-1)} + \frac{\Ve\trans{\Ve}}{1+\rho(p-1)} - \frac{\rho p \Ve\trans{\Ve}}{(1+\rho(p-1))^2}\right) \\
&= \frac{1}{(1-\rho)^2} \left(-I + \Ve\trans{\Ve} \frac{\rho+\rho^2(p-1) + 1+ \rho(p-1) - \rho p}{(1+\rho(p-1))^2}\right) \\
&= \frac{1}{(1-\rho)^2} \left(-I + \Ve\trans{\Ve} \frac{\rho^2(p-1) + 1}{(1+\rho(p-1))^2}\right) 
\end{align*}

We now consider the matrix \(\frac{1}{n}\sum_{i=1}^n (\VY_i-\widehat{\Vmu}_i)\trans{(\VY_i-\widehat{\Vmu}_i)}\) and denote by:
\begin{itemize}
\item \(\left(\widetilde{\sigma}^2_1,\ldots,\widetilde{\sigma}^2_p\right)=\left(\frac{1}{n}\sum_{i=1}^n
  (Y_{i,1}-\widehat{\mu}_{i,1})^2,\ldots,\frac{1}{n}\sum_{i=1}^n
  (Y_{i,p}-\widehat{\mu}_{i,p})^2\right)\) its diagonal elements. The tilde
notation is used instead of the hat notation to stress that they
generally differ from the time-specific empirical variance estimator
(which would center the residuals at each timepoint). Note that
their average equal the empirical residual variance:
\(\widehat{\sigma}^2 = \frac{1}{p} \sum_{j=1}^p
  \widetilde{\sigma}^2_j\).
\item \(\forall (j,j^{\prime})\in \{1,\ldots,p\}\) such that \(j \neq
  j^{\prime}\), we denote the off diagonal elements by
\(\widehat{\sigma}^2\widehat{\rho}_{j,j^{\prime}}\) where
\(\widehat{\rho}_{j,j^{\prime}} = \widehat{\rho}_{j^{\prime},j} =
  \frac{1}{n}\sum_{i=1}^n \frac{Y_{i,j}-\widehat{\mu}_{i,j}}{\widehat{\sigma}}
  \frac{Y_{i,j^{\prime}}-\widehat{\mu}_{i,j^{\prime}}}{\widehat{\sigma}}\) its
off diagonal elements.
\end{itemize}
Then:  
\begin{align*}
& tr \left( R^{-1} \frac{\partial R}{\partial\rho} R^{-1} \sum_{i=1}^n  (\VY_i-\widehat{\Vmu}_i)\trans{(\VY_i-\widehat{\Vmu}_i)} \right) \\
& = \frac{n\widehat{\sigma}^2}{(1-\rho)^2}\left(p\left(-1+\frac{\rho^2(p-1) + 1}{(1+\rho(p-1))^2}\right) + \frac{2\rho^2(p-1) + 2}{(1+\rho(p-1))^2} \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
&= \frac{n\widehat{\sigma}^2}{(1-\rho)^2}\left(p\left(\frac{-2\rho(p-1)-\rho^2(p-1)^2+\rho^2(p-1)}{(1+\rho(p-1))^2}\right) + \frac{2\rho^2(p-1) + 2}{(1+\rho(p-1))^2} \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
&= \frac{n\widehat{\sigma}^2}{(1-\rho)^2(1+\rho(p-1))^2}\left(p\rho(p-1)\left(-2-\rho (p-2)\right) + \left(2\rho^2(p-1) + 2\right) \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)
\end{align*}

The score equation becomes:
\begin{align*}
0 &= \frac{n p (p-1)}{2(1-\rho)^2(1+\rho(p-1))^2}\left(\rho(1-\rho)(1+\rho(p-1)) - \frac{\widehat{\sigma}^2}{\sigma^2}  \rho\left(2+\rho (p-2)\right) + \frac{\rho^2(p-1) + 1}{p(p-1)/2} \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
  &= \frac{n p (p-1)(\rho^2(p-1) + 1)}{2(1-\rho)^2(1+\rho(p-1))^2}\left(\rho\frac{(1-\rho)(1+\rho(p-1))- \frac{\widehat{\sigma}^2}{\sigma^2}  \left(2 + \rho (p-2)\right))}{\rho^2(p-1) + 1} + \frac{1}{p(p-1)/2} \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)
\end{align*}

Using that \((1-\rho)(1+\rho(p-1))=1-\rho+\rho(p-1)-\rho^2(p-1)=-\rho^2(p-1)+\rho(p-2)+1=-(\rho^2(p-1)+1)+\rho(p-2)+2\), it follows that:
\begin{align*}
0 &= \frac{n p (p-1) \rho^2(p-1) + 1}{2(1-\rho)^2(1+\rho(p-1))^2}\left(- \rho + \rho \frac{  \rho(p-2)+2 - \frac{\widehat{\sigma}^2}{\sigma^2}  \left(2 + \rho (p-2)\right))}{\rho^2(p-1) + 1} + \frac{1}{p(p-1)/2} \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
  &= \frac{n p (p-1) \rho^2(p-1) + 1}{2(1-\rho)^2(1+\rho(p-1))^2}\left(- \rho - \rho \left(\frac{\widehat{\sigma}^2}{\sigma^2}-1\right) \frac{2+\rho(p-2)}{1+\rho^2(p-1)} + \frac{1}{p(p-1)/2} \sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)
\end{align*}
Since the first term is strictly positive (\(0<\rho<1\) and \(p>1\)) we can simplify and get that:
\begin{align}
\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}  &= \rho + \rho \left(\frac{\sigma^2}{\widehat{\sigma}^2}-1\right)\frac{2+\rho (p-2)}{1 + \rho^2(p-1)}   \label{eq:scoreRho:simplified2}
\end{align}
