doc/2024_10_10-random-intercept/post-random-intercept.org
** Variance parameter (ML)

The ML score equation w.r.t the variance parameter is:
#+BEGIN_EXPORT latex
\begin{align*}
0=&-\frac{n}{2} tr\left(\Omega^{-1} \frac{\partial \Omega}{\partial\sigma^2}\right) + \frac{1}{2} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} \Omega^{-1} \frac{\partial \Omega}{\partial \sigma^2} \Omega^{-1} (\VY_i-\widehat{\Vmu}_i) \\
 =&-\frac{n}{2} tr\left(\sigma^{-2} R^{-1} R \right) + \frac{1}{2 \sigma^4} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} R^{-1} R R^{-1} (\VY_i-\widehat{\Vmu}_i) \\
 =&-\frac{np}{2 \sigma^2} + \frac{1}{2 \sigma^4} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} R^{-1} (\VY_i-\widehat{\Vmu}_i) 
\end{align*}
#+END_EXPORT

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
eML.RI <- lmm(Y~treatment+(1|id), data = dfL, method.fit = "ML")

epsilon <- eML.RI$residuals
Omega <- sigma(eML.RI)
R <- cov2cor(Omega)
sigma2 <- coef(eML.RI, effects = "variance")^2
rho <- coef(eML.RI, effects = "correlation")
p <- NROW(Omega)

sigma2 - sum(tapply(1:NROW(dfL), dfL$id, function(iIndex){
  t(epsilon[iIndex]) %*% solve(R) %*% epsilon[iIndex]
}))/NROW(dfL)
#+END_SRC

#+RESULTS:
:        sigma 
: 2.683365e-11

Using the expression of \(R^{-1}\) found in appendix [[#sm:rhoML]] we get:
#+BEGIN_EXPORT latex
\begin{align*}
0 =&-\frac{np}{2 \sigma^2} + \frac{1}{2 \sigma^4(1- \rho)} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} \left(I - \frac{\rho \Ve\trans{\Ve}}{(1-\rho)+\rho p} \right) (\VY_i-\widehat{\Vmu}_i) \\ 
  =&-\frac{np}{2 \sigma^2} + \frac{1}{2 \sigma^4(1- \rho)} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)}(\VY_i-\widehat{\Vmu}_i) \\ & - \frac{\rho}{2 \sigma^4(1- \rho)((1-\rho)+\rho p)} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)}\Ve\trans{\Ve}(\VY_i-\widehat{\Vmu}_i)  \\ 
  =&-\frac{np}{2 \sigma^2} + \frac{np\widehat{\sigma}^2}{2 \sigma^4(1- \rho)} - \frac{\rho n p^2}{2 \sigma^4(1- \rho)((1-\rho)+\rho p)} \frac{1}{n}\sum_{i=1}^n \left(\frac{1}{p} \sum_{i=1}^n Y_{i,j} - \widehat{\mu}_{i,j} \right)^2 
\end{align*}
#+END_EXPORT

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
sigma2 - sigma2/(1-rho) + rho*p/((1-rho)^2+rho*(1-rho)*p) * mean(tapply(epsilon, dfL$id, mean)^2)
#+END_SRC

#+RESULTS:
:        sigma 
: 2.682299e-11

Since:
#+BEGIN_EXPORT latex
\begin{align*}
\frac{1}{n} \sum_{i=1}^n \left(\frac{1}{p}\sum_{j=1}^p Y_{i,j}-\widehat{\mu}_{i,j}\right)^2=& \frac{1}{np^2} \sum_{i=1}^n \sum_{j=1}^p \sum_{j^{\prime}=1}^p \left(Y_{i,j}-\widehat{\mu}_j\right)\left(Y_{i,j^{\prime}}-\widehat{\mu}_{j^{\prime}}\right) \\
=&  \frac{\widehat{\sigma}^2}{p^2} \left(p + 2\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)  = \frac{\widehat{\sigma}^2}{p} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) 
\end{align*}
#+END_EXPORT

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
M.resW <- reshape(dfL[,c("id","visit","res")],
                  direction = "wide", idvar = "id", timevar = "visit")
M.resVcov <- crossprod(as.matrix(M.resW[,-1]))/NROW(M.resW)
mean(tapply(epsilon, dfL$id, mean)^2) - mean(M.resVcov)
#+END_SRC

#+RESULTS:
: [1] -1.776357e-15

we obtain:
#+BEGIN_EXPORT latex
\begin{align*}
0 =&-\frac{np}{2 \sigma^2} + \frac{np\widehat{\sigma}^2}{2 \sigma^4(1- \rho)} - \frac{\rho n p \widehat{\sigma}^2}{2 \sigma^4(1- \rho)((1-\rho)+\rho p)} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
0 =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} - \frac{1}{(1- \rho)} + \frac{\rho }{(1- \rho)((1-\rho)+\rho p)} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)\right)  
\end{align*}
#+END_EXPORT
Since
#+BEGIN_EXPORT latex
\begin{align*}
& - \frac{1}{(1- \rho)}  + \frac{\rho}{(1-\rho)^2+\rho(1-\rho)p} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
=& - \frac{1}{(1- \rho)}\left(1  - \frac{\rho}{1+\rho(p-1)} - \frac{\rho(p-1)}{1+\rho(p-1)}\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
=&  -\frac{1}{(1- \rho)(1+\rho(p-1))}\left(1 + \rho (p-2) - \rho(p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) 
\end{align*}
#+END_EXPORT

We get:
#+BEGIN_EXPORT latex
\begin{align*}
0 =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} -\frac{1}{(1- \rho)(1+\rho(p-1))}\left(1 + \rho (p-2) - \rho(p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)\right)   \\
  =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} -\frac{1}{1 + \rho(p-2)  - \rho^2(p-1)}\left(1 + \rho (p-2) - \rho(p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)\right) \\
  =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} - 1  - \frac{\rho(p-1)\left(\rho-\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)}{1 + \rho(p-2)  - \rho^2(p-1)}\right) 
\end{align*}
#+END_EXPORT

Since \(\frac{np \widehat{\sigma}^2}{2 \sigma^4}\neq 0\) and using equation autoref:eq:scoreRho:simplified2, we obtain:
#+BEGIN_EXPORT latex
\begin{align*}
0 &= \frac{\sigma^2}{\widehat{\sigma}^2} - 1 + \frac{\rho^2(p-1)\left(\frac{\sigma^2}{\widehat{\sigma}^2}-1\right)\frac{2+\rho (p-2)}{1 + \rho^2(p-1)}}{1 + \rho(p-2)  - \rho^2(p-1)} 
= \left(\frac{\sigma^2}{\widehat{\sigma}^2} - 1\right) \left(1 + \frac{\rho^2(p-1)\frac{2+\rho (p-2)}{1 + \rho^2(p-1)}}{(1- \rho)(1+\rho(p-1))}\right) 
\end{align*}
#+END_EXPORT
The second term is strictly positive: it is clear when \(p>2\) because
all terms are positive or null and one is added. When \(p=1\) then \(2+\rho
(p-2)=2-\rho>0\) because \(\rho<1\). So we must have \(\sigma^2 =
\widehat{\sigma}^2\). Plugging this value in the score equation for
the correlation parameter leads to:
#+BEGIN_EXPORT latex
\begin{align*}
\rho &= \frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}} 
\end{align*}
#+END_EXPORT

** Correlation parameter (REML) :noexport:

The REML score equation w.r.t the correlation parameter is the same as the ML score equation with the additional term:
#+BEGIN_EXPORT latex
\begin{align*}
&\frac{1}{2} tr\left(\left(\trans{X}\Omega^{-1}X\right)^{-1} \left(\trans{X}\Omega^{-1}\frac{\partial \Omega}{\partial\rho}\Omega^{-1}X \right) \right) \\
=&\frac{1}{2 \sigma^4} tr\left(\left(\trans{X}R^{-1}X\right)^{-1} \left(\trans{X}R^{-1}\frac{\partial R}{\partial\rho}R^{-1}X \right) \right) 
\end{align*}
#+END_EXPORT

Using from appendix [[#sm:seRI]] that:
#+BEGIN_EXPORT latex
\begin{align*}
\left(\trans{X}R^{-1}X\right)^{-1} = \frac{1}{p-p_1} \begin{bmatrix} 1+\rho (p-p_1-1)
                  & -(1-\rho)
                  \\ -(1-\rho)
                  & \frac{p}{p_1}(1-\rho)
                  \end{bmatrix}
\end{align*}
#+END_EXPORT

and that:

#+BEGIN_EXPORT latex
\begin{align*}
R^{-1} \frac{\partial R}{\partial\rho} R^{-1} &= \frac{1}{(1-\rho)^2} \left(-I + \Ve\trans{\Ve} \frac{\rho^2(p-1) + 1}{(1+\rho(p-1))^2}\right) \\
\trans{X}R^{-1} \frac{\partial R}{\partial\rho} R^{-1} X &= \frac{1}{(1-\rho)^2} \left(-\trans{X}X + \trans{X}\Ve\trans{\Ve}X \frac{\rho^2(p-1) + 1}{(1+\rho(p-1))^2}\right)  \\
&= \frac{1}{(1-\rho)^2} \left(-\begin{bmatrix} p
                  & p_1
                  \\ p_1
                  & p
                  \end{bmatrix}
                  + \begin{bmatrix} p^2
                  & p p_1
                  \\ p p_1
                  & p_1^2
                  \end{bmatrix} \frac{\rho^2(p-1) + 1}{(1+\rho(p-1))^2}\right) 
\end{align*}
#+END_EXPORT
which does not seems to simplify, i.e. the trace has a complicated expression.

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
rho <- 0.3

X <- cbind(1,c(0,0,1,1))
Omega <- rho + (1-rho)*diag(1,4)
sum(diag(solve(t(X) %*% solve(Omega) %*% X) %*% t(X) %*% solve(Omega) %*% (1 - diag(NROW(Omega))) %*% solve(Omega) %*% X))

X <- cbind(1,c(0,0,0,1,1,1))
Omega <- rho + (1-rho)*diag(1,6)
sum(diag(solve(t(X) %*% solve(Omega) %*% X) %*% t(X) %*% solve(Omega) %*% (1 - diag(NROW(Omega))) %*% solve(Omega) %*% X))
#+END_SRC

#+RESULTS:
: [1] 0.1503759
: [1] 0.5714286


** Variance parameter (REML)  :noexport:

The REML score equation w.r.t the variance parameter is the same as the ML score equation with the additional term:
#+BEGIN_EXPORT latex
\begin{align*}
&\frac{1}{2} tr\left(\left(\trans{X}\Omega^{-1}X\right)^{-1} \left(\trans{X}\Omega^{-1}\frac{\partial \Omega}{\partial\sigma^2}\Omega^{-1}X \right) \right) \\
&= \frac{1}{2\sigma^2} tr\left(\left(\trans{X}\Omega^{-1}X\right)^{-1} \left(\trans{X}\Omega^{-1}X \right) \right) = \frac{2}{2\sigma^2}
\end{align*}
#+END_EXPORT
leading to
#+BEGIN_EXPORT latex
\begin{align*}
\sigma^2 =& \frac{1}{n p - 2} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} R^{-1} (\VY_i-\widehat{\Vmu}_i) 
\end{align*}
#+END_EXPORT


#+BEGIN_SRC R :exports none :results output :session *R* :cache no
X <- cbind(1,c(0,0,1,1))
Omega <- 0.4 + 0.6*diag(1,4)
sum(diag(solve(t(X) %*% solve(Omega) %*% X) %*% t(X) %*% solve(Omega) %*% Omega %*% solve(Omega) %*% X))

X <- cbind(1,c(0,0,0,1,1,1))
Omega <- 0.4 + 0.6*diag(1,6)
sum(diag(solve(t(X) %*% solve(Omega) %*% X) %*% t(X) %*% solve(Omega) %*% Omega %*% solve(Omega) %*% X))
#+END_SRC

#+RESULTS:
: [1] 2
: [1] 2

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
eREML.RI <- lmm(Y~treatment+(1|id), data = dfL, method.fit = "REML")
R <- cov2cor(sigma(eREML.RI))
epsilon <- residuals(eREML.RI)
sum(tapply(epsilon, dfL$id, function(iEps){t(iEps) %*% solve(R) %*% iEps}))/(NROW(dfL)-2)
coef(eREML.RI, effects = "variance")^2
#+END_SRC

#+RESULTS:
: [1] 16.54774
:    sigma 
: 16.54774

\clearpage

