doc/2024_10_10-random-intercept/post-random-intercept.tex

\subsection{Variance parameter (ML)}
\label{sec:org193e6ec}

The ML score equation w.r.t the variance parameter is:
\begin{align*}
0=&-\frac{n}{2} tr\left(\Omega^{-1} \frac{\partial \Omega}{\partial\sigma^2}\right) + \frac{1}{2} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} \Omega^{-1} \frac{\partial \Omega}{\partial \sigma^2} \Omega^{-1} (\VY_i-\widehat{\Vmu}_i) \\
 =&-\frac{n}{2} tr\left(\sigma^{-2} R^{-1} R \right) + \frac{1}{2 \sigma^4} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} R^{-1} R R^{-1} (\VY_i-\widehat{\Vmu}_i) \\
 =&-\frac{np}{2 \sigma^2} + \frac{1}{2 \sigma^4} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} R^{-1} (\VY_i-\widehat{\Vmu}_i) 
\end{align*}

Using the expression of \(R^{-1}\) found in appendix \ref{sm:rhoML} we get:
\begin{align*}
0 =&-\frac{np}{2 \sigma^2} + \frac{1}{2 \sigma^4(1- \rho)} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)} \left(I - \frac{\rho \Ve\trans{\Ve}}{(1-\rho)+\rho p} \right) (\VY_i-\widehat{\Vmu}_i) \\ 
  =&-\frac{np}{2 \sigma^2} + \frac{1}{2 \sigma^4(1- \rho)} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)}(\VY_i-\widehat{\Vmu}_i) \\ & - \frac{\rho}{2 \sigma^4(1- \rho)((1-\rho)+\rho p)} \sum_{i=1}^n \trans{(\VY_i-\widehat{\Vmu}_i)}\Ve\trans{\Ve}(\VY_i-\widehat{\Vmu}_i)  \\ 
  =&-\frac{np}{2 \sigma^2} + \frac{np\widehat{\sigma}^2}{2 \sigma^4(1- \rho)} - \frac{\rho n p^2}{2 \sigma^4(1- \rho)((1-\rho)+\rho p)} \frac{1}{n}\sum_{i=1}^n \left(\frac{1}{p} \sum_{i=1}^n Y_{i,j} - \widehat{\mu}_{i,j} \right)^2 
\end{align*}

Since:
\begin{align*}
\frac{1}{n} \sum_{i=1}^n \left(\frac{1}{p}\sum_{j=1}^p Y_{i,j}-\widehat{\mu}_{i,j}\right)^2=& \frac{1}{np^2} \sum_{i=1}^n \sum_{j=1}^p \sum_{j^{\prime}=1}^p \left(Y_{i,j}-\widehat{\mu}_j\right)\left(Y_{i,j^{\prime}}-\widehat{\mu}_{j^{\prime}}\right) \\
=&  \frac{\widehat{\sigma}^2}{p^2} \left(p + 2\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)  = \frac{\widehat{\sigma}^2}{p} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) 
\end{align*}

we obtain:
\begin{align*}
0 =&-\frac{np}{2 \sigma^2} + \frac{np\widehat{\sigma}^2}{2 \sigma^4(1- \rho)} - \frac{\rho n p \widehat{\sigma}^2}{2 \sigma^4(1- \rho)((1-\rho)+\rho p)} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
0 =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} - \frac{1}{(1- \rho)} + \frac{\rho }{(1- \rho)((1-\rho)+\rho p)} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)\right)  
\end{align*}
Since
\begin{align*}
& - \frac{1}{(1- \rho)}  + \frac{\rho}{(1-\rho)^2+\rho(1-\rho)p} \left(1 + (p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
=& - \frac{1}{(1- \rho)}\left(1  - \frac{\rho}{1+\rho(p-1)} - \frac{\rho(p-1)}{1+\rho(p-1)}\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) \\
=&  -\frac{1}{(1- \rho)(1+\rho(p-1))}\left(1 + \rho (p-2) - \rho(p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right) 
\end{align*}

We get:
\begin{align*}
0 =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} -\frac{1}{(1- \rho)(1+\rho(p-1))}\left(1 + \rho (p-2) - \rho(p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)\right)   \\
  =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} -\frac{1}{1 + \rho(p-2)  - \rho^2(p-1)}\left(1 + \rho (p-2) - \rho(p-1)\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)\right) \\
  =&-\frac{np \widehat{\sigma}^2}{2 \sigma^4}\left(\frac{\sigma^2}{\widehat{\sigma}^2} - 1  - \frac{\rho(p-1)\left(\rho-\frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}}\right)}{1 + \rho(p-2)  - \rho^2(p-1)}\right) 
\end{align*}

Since \(\frac{np \widehat{\sigma}^2}{2 \sigma^4}\neq 0\) and using equation \autoref{eq:scoreRho:simplified2}, we obtain:
\begin{align*}
0 &= \frac{\sigma^2}{\widehat{\sigma}^2} - 1 + \frac{\rho^2(p-1)\left(\frac{\sigma^2}{\widehat{\sigma}^2}-1\right)\frac{2+\rho (p-2)}{1 + \rho^2(p-1)}}{1 + \rho(p-2)  - \rho^2(p-1)} 
= \left(\frac{\sigma^2}{\widehat{\sigma}^2} - 1\right) \left(1 + \frac{\rho^2(p-1)\frac{2+\rho (p-2)}{1 + \rho^2(p-1)}}{(1- \rho)(1+\rho(p-1))}\right) 
\end{align*}
The second term is strictly positive: it is clear when \(p>2\) because
all terms are positive or null and one is added. When \(p=1\) then \(2+\rho
(p-2)=2-\rho>0\) because \(\rho<1\). So we must have \(\sigma^2 =
\widehat{\sigma}^2\). Plugging this value in the score equation for
the correlation parameter leads to:
\begin{align*}
\rho &= \frac{1}{p(p-1)/2}\sum_{j < j^{\prime}}\widehat{\rho}_{j,j^{\prime}} 
\end{align*}
